# Consider two excel files having attendance of a workshop’s participants for two days. Each file has three fields ‘Name’, ‘Time of joining’, duration (in minutes) where names are unique within a file. Note that duration may take one of three values (30, 40, 50) only. Import the data into two dataframes and do the following:

In [3]:
import numpy as np
import pandas as pd
d1 = pd.read_excel(r"C:\Users\visha\Downloads\data1.xlsx")
d2 = pd.read_excel(r"C:\Users\visha\Downloads\data2.xlsx")

In [4]:
d1

       Name      Time  Duration
0    Shruti  02:20:25        40
1    Simran  02:30:26        30
2    Vishav  02:40:27        30
3     Colby  02:50:28        50
4  Cathenna  03:30:29        40
5    Xander  03:40:30        50
6     Aiden  03:40:31        30
7     Ronan  03:10:32        40
8      Cole  03:20:33        30

In [5]:
d2

       Name      Time  Duration
0      Elsa  02:20:25        40
1  Kimberly  02:35:26        30
2    Silver  02:10:27        30
3     Conen  02:50:28        50
4      Teal  03:25:29        40
5    Xander  03:40:30        50
6     Aiden  03:40:31        30
7     Ronan  03:15:32        40
8      Cole  03:20:33        30

## a. Perform merging of the two dataframes to find the names of students who had attended the workshop on both days.

In [9]:
common_attendees = pd.merge(d1, d2, on='Name', how='inner')
print("Names of students who attended the workshop on both days:")
print(common_attendees['Name'])

Names of students who attended the workshop on both days:
0    Xander
1     Aiden
2     Ronan
3      Cole
Name: Name, dtype: object

## b. Find names of all students who have attended workshop on either of the days.

In [10]:
all_attendees = pd.merge(d1, d2, on='Name', how='outer')
print("\nNames of all students who attended the workshop on either day:")
print(all_attendees['Name'])

Names of all students who attended the workshop on either day:
0       Shruti
1       Simran
2       Vishav
3        Colby
4     Cathenna
5       Xander
6        Aiden
7        Ronan
8         Cole
9         Elsa
10    Kimberly
11      Silver
12       Conen
13        Teal
Name: Name, dtype: object

## c. Merge two data frames row-wise and find the total number of records in the data frame.

In [11]:
merged_row_wise = pd.concat([d1, d2], ignore_index=True)
print("\nTotal number of records after merging row-wise:", len(merged_row_wise))

Total number of records after merging row-wise: 18

## d. Merge two data frames and use two columns names and duration as multi-row indexes. Generate descriptive statistics for this multi-index.

In [15]:
merged_multi_index = pd.merge(d1, d2, on=['Name', 'Duration'], how='outer')
print("\nDescriptive statistics for merged data with multi-row indexes:")
print(merged_multi_index.groupby(['Name', 'Duration']).describe())

Descriptive statistics for merged data with multi-row indexes:
                  Time_x                       Time_y
                   count unique       top freq  count unique       top freq
Name     Duration
Aiden    30            1      1  03:40:31    1      1      1  03:40:31    1
Cathenna 40            1      1  03:30:29    1      0      0       NaN  NaN
Colby    50            1      1  02:50:28    1      0      0       NaN  NaN
Cole     30            1      1  03:20:33    1      1      1  03:20:33    1
Conen    50            0      0       NaN  NaN      1      1  02:50:28    1
Elsa     40            0      0       NaN  NaN      1      1  02:20:25    1
Kimberly 30            0      0       NaN  NaN      1      1  02:35:26    1
Ronan    40            1      1  03:10:32    1      1      1  03:15:32    1
Shruti   40            1      1  02:20:25    1      0      0       NaN  NaN
Silver   30            0      0       NaN  NaN      1      1  02:10:27    1
Simran   30            1      1  02:30:26    1      0      0       NaN  NaN
Teal     40            0      0       NaN  NaN      1      1  03:25:29    1
Vishav   30            1      1  02:40:27    1      0      0       NaN  NaN
Xander   50            1      1  03:40:30    1      1      1  03:40:30    1